memcached_test_by_memtier_benchmark/memcached_Experiment_I_OFF_2nd/memcached_I_OFF_2nd_Sequential82_P2_20230401212951.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        52314.23          ---          ---        12.22057        12.09500        15.10300        16.51100    109532.91 
Gets       209256.31    209256.31         0.00        12.23344        12.09500        15.10300        16.51100    453252.44 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     261570.54    209256.31         0.00        12.23086        12.09500        15.10300        16.51100    562785.35 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.319        0.000
SET      10.495        5.000
SET      10.815       10.000
SET      11.007       15.000
SET      11.199       20.000
SET      11.327       25.000
SET      11.519       30.000
SET      11.647       35.000
SET      11.775       40.000
SET      11.967       45.000
SET      12.095       50.000
SET      12.159       52.500
SET      12.287       55.000
SET      12.351       57.500
SET      12.479       60.000
SET      12.607       62.500
SET      12.735       65.000
SET      12.799       67.500
SET      12.927       70.000
SET      13.055       72.500
SET      13.183       75.000
SET      13.183       76.250
SET      13.247       77.500
SET      13.311       78.750
SET      13.375       80.000
SET      13.439       81.250
SET      13.503       82.500
SET      13.567       83.750
SET      13.567       85.000
SET      13.631       86.250
SET      13.695       87.500
SET      13.759       88.125
SET      13.759       88.750
SET      13.823       89.375
SET      13.823       90.000
SET      13.887       90.625
SET      13.951       91.250
SET      13.951       91.875
SET      14.015       92.500
SET      14.079       93.125
SET      14.079       93.750
SET      14.143       94.062
SET      14.143       94.375
SET      14.207       94.688
SET      14.207       95.000
SET      14.271       95.312
SET      14.271       95.625
SET      14.335       95.938
SET      14.335       96.250
SET      14.399       96.562
SET      14.463       96.875
SET      14.463       97.031
SET      14.463       97.188
SET      14.527       97.344
SET      14.527       97.500
SET      14.591       97.656
SET      14.591       97.812
SET      14.655       97.969
SET      14.719       98.125
SET      14.783       98.281
SET      14.783       98.438
SET      14.847       98.516
SET      14.911       98.594
SET      14.911       98.672
SET      14.975       98.750
SET      14.975       98.828
SET      15.039       98.906
SET      15.103       98.984
SET      15.167       99.062
SET      15.231       99.141
SET      15.295       99.219
SET      15.359       99.258
SET      15.359       99.297
SET      15.423       99.336
SET      15.487       99.375
SET      15.551       99.414
SET      15.615       99.453
SET      15.615       99.492
SET      15.679       99.531
SET      15.743       99.570
SET      15.807       99.609
SET      15.871       99.629
SET      15.871       99.648
SET      15.935       99.668
SET      15.999       99.688
SET      15.999       99.707
SET      16.063       99.727
SET      16.063       99.746
SET      16.127       99.766
SET      16.191       99.785
SET      16.255       99.805
SET      16.255       99.814
SET      16.255       99.824
SET      16.319       99.834
SET      16.319       99.844
SET      16.383       99.854
SET      16.383       99.863
SET      16.511       99.873
SET      16.511       99.883
SET      16.511       99.893
SET      16.511       99.902
SET      16.511       99.907
SET      16.639       99.912
SET      16.639       99.917
SET      16.639       99.922
SET      16.639       99.927
SET      16.639       99.932
SET      16.639       99.937
SET      16.767       99.941
SET      16.767       99.946
SET      16.767       99.951
SET      16.767       99.954
SET      16.767       99.956
SET      16.767       99.958
SET      16.767       99.961
SET      16.895       99.963
SET      16.895       99.966
SET      16.895       99.968
SET      16.895       99.971
SET      16.895       99.973
SET      16.895       99.976
SET      16.895       99.977
SET      17.023       99.978
SET      17.023       99.979
SET      17.023       99.980
SET      17.023       99.982
SET      17.023       99.983
SET      17.023       99.984
SET      17.023       99.985
SET      17.023       99.987
SET      17.151       99.988
SET      17.151       99.988
SET      17.151       99.989
SET      17.151       99.990
SET      17.151       99.990
SET      17.151       99.991
SET      17.151       99.991
SET      17.151       99.992
SET      17.279       99.993
SET      17.279       99.993
SET      17.279       99.994
SET      17.279       99.994
SET      17.279       99.995
SET      17.279       99.995
SET      17.279       99.995
SET      17.407       99.995
SET      17.407       99.996
SET      17.407       99.996
SET      17.407       99.996
SET      17.407       99.997
SET      17.407       99.997
SET      17.407       99.997
SET      17.535       99.997
SET      17.535       99.997
SET      17.535       99.998
SET      17.535       99.998
SET      17.535       99.998
[...]
SET      17.663       99.998
SET      17.663       99.998
SET      17.663       99.998
SET      17.663       99.999
SET      17.663       99.999
SET      17.663       99.999
[...]
SET      17.791       99.999
SET      17.791       99.999
SET      17.791       99.999
[...]
SET      17.919       99.999
SET      17.919       99.999
SET      17.919       99.999
[...]
SET      18.047       99.999
SET      18.047      100.000
SET      18.047      100.000
SET      18.047      100.000
[...]
SET      18.175      100.000
SET      18.175      100.000
SET      18.175      100.000
[...]
SET      18.303      100.000
SET      18.303      100.000
SET      18.303      100.000
[...]
SET      18.431      100.000
SET      18.431      100.000
SET      18.431      100.000
[...]
SET      18.559      100.000
SET      18.559      100.000
SET      18.559      100.000
[...]
SET      18.687      100.000
SET      18.687      100.000
SET      18.687      100.000
[...]
SET      18.815      100.000
SET      18.815      100.000
---
GET       0.319        0.000
GET      10.495        5.000
GET      10.815       10.000
GET      11.007       15.000
GET      11.199       20.000
GET      11.327       25.000
GET      11.519       30.000
GET      11.647       35.000
GET      11.775       40.000
GET      11.967       45.000
GET      12.095       50.000
GET      12.223       52.500
GET      12.287       55.000
GET      12.415       57.500
GET      12.479       60.000
GET      12.607       62.500
GET      12.735       65.000
GET      12.863       67.500
GET      12.927       70.000
GET      13.055       72.500
GET      13.183       75.000
GET      13.247       76.250
GET      13.247       77.500
GET      13.311       78.750
GET      13.375       80.000
GET      13.439       81.250
GET      13.503       82.500
GET      13.567       83.750
GET      13.631       85.000
GET      13.695       86.250
GET      13.759       87.500
GET      13.759       88.125
GET      13.823       88.750
GET      13.823       89.375
GET      13.887       90.000
GET      13.887       90.625
GET      13.951       91.250
GET      13.951       91.875
GET      14.015       92.500
GET      14.079       93.125
GET      14.143       93.750
GET      14.143       94.062
GET      14.143       94.375
GET      14.207       94.688
GET      14.207       95.000
GET      14.271       95.312
GET      14.271       95.625
GET      14.335       95.938
GET      14.335       96.250
GET      14.399       96.562
GET      14.463       96.875
GET      14.463       97.031
GET      14.527       97.188
GET      14.527       97.344
GET      14.591       97.500
GET      14.591       97.656
GET      14.655       97.812
GET      14.655       97.969
GET      14.719       98.125
GET      14.783       98.281
GET      14.847       98.438
GET      14.847       98.516
GET      14.911       98.594
GET      14.911       98.672
GET      14.975       98.750
GET      15.039       98.828
GET      15.039       98.906
GET      15.103       98.984
GET      15.167       99.062
GET      15.231       99.141
GET      15.295       99.219
GET      15.359       99.258
GET      15.423       99.297
GET      15.423       99.336
GET      15.487       99.375
GET      15.551       99.414
GET      15.615       99.453
GET      15.679       99.492
GET      15.743       99.531
GET      15.807       99.570
GET      15.871       99.609
GET      15.871       99.629
GET      15.935       99.648
GET      15.935       99.668
GET      15.999       99.688
GET      15.999       99.707
GET      16.063       99.727
GET      16.127       99.746
GET      16.127       99.766
GET      16.191       99.785
GET      16.255       99.805
GET      16.255       99.814
GET      16.319       99.824
GET      16.319       99.834
GET      16.319       99.844
GET      16.383       99.854
GET      16.383       99.863
GET      16.511       99.873
GET      16.511       99.883
GET      16.511       99.893
GET      16.511       99.902
GET      16.639       99.907
GET      16.639       99.912
GET      16.639       99.917
GET      16.639       99.922
GET      16.639       99.927
GET      16.639       99.932
GET      16.767       99.937
GET      16.767       99.941
GET      16.767       99.946
GET      16.767       99.951
GET      16.767       99.954
GET      16.767       99.956
GET      16.767       99.958
GET      16.895       99.961
GET      16.895       99.963
GET      16.895       99.966
GET      16.895       99.968
GET      16.895       99.971
GET      16.895       99.973
GET      16.895       99.976
GET      17.023       99.977
GET      17.023       99.978
GET      17.023       99.979
GET      17.023       99.980
GET      17.023       99.982
GET      17.023       99.983
GET      17.023       99.984
GET      17.023       99.985
GET      17.151       99.987
GET      17.151       99.988
GET      17.151       99.988
GET      17.151       99.989
GET      17.151       99.990
GET      17.151       99.990
GET      17.151       99.991
GET      17.151       99.991
GET      17.279       99.992
GET      17.279       99.993
GET      17.279       99.993
GET      17.279       99.994
GET      17.279       99.994
GET      17.279       99.995
GET      17.279       99.995
GET      17.279       99.995
GET      17.407       99.995
GET      17.407       99.996
GET      17.407       99.996
GET      17.407       99.996
GET      17.407       99.997
GET      17.407       99.997
GET      17.407       99.997
GET      17.535       99.997
GET      17.535       99.997
GET      17.535       99.998
GET      17.535       99.998
GET      17.535       99.998
[...]
GET      17.663       99.998
GET      17.663       99.998
GET      17.663       99.999
GET      17.663       99.999
GET      17.663       99.999
[...]
GET      17.791       99.999
GET      17.791       99.999
GET      17.791       99.999
[...]
GET      17.919       99.999
GET      17.919       99.999
GET      17.919       99.999
[...]
GET      18.047      100.000
GET      18.047      100.000
GET      18.047      100.000
[...]
GET      18.175      100.000
GET      18.175      100.000
GET      18.175      100.000
[...]
GET      18.303      100.000
GET      18.303      100.000
GET      18.303      100.000
[...]
GET      18.431      100.000
GET      18.431      100.000
GET      18.431      100.000
[...]
GET      18.559      100.000
GET      18.559      100.000
GET      18.559      100.000
[...]
GET      18.687      100.000
GET      18.687      100.000
GET      18.687      100.000
[...]
GET      18.815      100.000
GET      18.815      100.000
GET      18.815      100.000
[...]
GET      18.943      100.000
GET      18.943      100.000
GET      18.943      100.000
[...]
GET      19.071      100.000
GET      19.071      100.000
GET      19.071      100.000
[...]
GET      19.199      100.000
GET      19.199      100.000
---
WAIT      0.000      100.000